// use
// https://ekitan.com/timetable/railway/line-station/701-0?d=1&dw=2

var a = `
05

    [各停]貝 39
    [各停]貝 56

06

    [各停]貝 14
    [各停]貝 34
    [各停]貝 49

07

    [各停]貝 02
    [各停]貝 12
    [各停]貝 23
    [各停]貝 34
    [各停]貝 43
    [各停]貝 50

08

    [各停]貝 00
    [各停]貝 09
    [各停]貝 18
    [各停]貝 28
    [各停]貝 33
    [各停]貝 43
    [各停]貝 49
    [各停]貝 55

09

    [各停]貝 03
    [各停]貝 11
    [各停]貝 18
    [各停]貝 23
    [各停]貝 31
    [各停]貝 41
    [各停]貝 49
    [各停]貝 57

10

    [各停]貝 03
    [各停]貝 10
    [各停]貝 15
    [各停]貝 26
    [各停]貝 34
    [各停]貝 42
    [各停]貝 49
    [各停]貝 55

11

    [各停]貝 02
    [各停]貝 11
    [各停]貝 19
    [各停]貝 27
    [各停]貝 34
    [各停]貝 41
    [各停]貝 49
    [各停]貝 56

12

    [各停]貝 04
    [各停]貝 11
    [各停]貝 19
    [各停]貝 26
    [各停]貝 33
    [各停]貝 41
    [各停]貝 49
    [各停]貝 56

13

    [各停]貝 05
    [各停]貝 11
    [各停]貝 19
    [各停]貝 26
    [各停]貝 34
    [各停]貝 41
    [各停]貝 49
    [各停]貝 56

14

    [各停]貝 04
    [各停]貝 12
    [各停]貝 17
    [各停]貝 26
    [各停]貝 32
    [各停]貝 41
    [各停]貝 49
    [各停]貝 56

15

    [各停]貝 04
    [各停]貝 11
    [各停]貝 19
    [各停]貝 26
    [各停]貝 33
    [各停]貝 41
    [各停]貝 47
    [各停]貝 55

16

    [各停]貝 03
    [各停]貝 10
    [各停]貝 17
    [各停]貝 27
    [各停]貝 35
    [各停]貝 43
    [各停]貝 49
    [各停]貝 57

17

    [各停]貝 05
    [各停]貝 14
    [各停]貝 21
    [各停]貝 34
    [各停]貝 46
    [各停]貝 55

18

    [各停]貝 04
    [各停]貝 15
    [各停]貝 21
    [各停]貝 32
    [各停]貝 39
    [各停]貝 48
    [各停]貝 55

19

    [各停]貝 03
    [各停]貝 15
    [各停]貝 25
    [各停]貝 35
    [各停]貝 47
    [各停]貝 57

20

    [各停]貝 10
    [各停]貝 20
    [各停]貝 34
    [各停]貝 47
    [各停]貝 54

21

    [各停]貝 03
    [各停]貝 16
    [各停]貝 26
    [各停]貝 37
    [各停]貝 48

22

    [各停]貝 01
    [各停]貝 13
    [各停]貝 24
    [各停]貝 36
    [各停]貝 47

23

    [各停]貝 00
    [各停]貝 18
    [各停]貝 40
    [各停]貝 58


`

var a = a.split(/[\r\n]+/).filter(p => p !== '')
var h = -1
var res = []
for (i = 0; i < a.length; i++){
  if (!a[i].startsWith(' ')){
    h = a[i]
  }
  else {
  var p = a[i].trim().split(" ")[1]
        if(h.startsWith("0")) h = h.substring(1)
        res.push(h + p)

  }
}


var name = 'nakasuKaizukaHoliday'
res.forEach(p => console.log(name + '.put(' + p + ', new Ref(' + p + '));'))


//        nakasuKaizuka.put(542, new Ref(542));




