// use https://time.ekitan.com/train/TimeStation/702-4_D1_DW0.shtml

var a = `

5

    [各停]福空
    46

    [各停]福空
    58

6

    [各停]福空
    05

    [各停]福空
    18

    [各停]福空
    31

    [各停]福空
    45

    [各停]福空
    58

7

    [各停]福空
    08

    [各停]福空
    19

    [各停]福空
    25

    [各停]福空
    31

    [各停]福空
    39

    [各停]福空
    47

    [各停]福空
    56

8

    [各停]福空
    04

    [各停]福空
    12

    [各停]福空
    19

    [各停]福空
    25

    [各停]福空
    34

    [各停]福空
    40

    [各停]福空
    46

    [各停]福空
    51

    [各停]福空
    58

9

    [各停]福空
    07

    [各停]福空
    17

    [各停]福空
    26

    [各停]福空
    34

    [各停]福空
    39

    [各停]福空
    46

    [各停]福空
    52

    [各停]福空
    59

10

    [各停]福空
    08

    [各停]福空
    18

    [各停]福空
    25

    [各停]福空
    31

    [各停]福空
    39

    [各停]福空
    46

    [各停]福空
    55

11

    [各停]福空
    04

    [各停]福空
    10

    [各停]福空
    16

    [各停]福空
    24

    [各停]福空
    31

    [各停]福空
    39

    [各停]福空
    46

    [各停]福空
    54

12

    [各停]福空
    01

    [各停]福空
    09

    [各停]福空
    16

    [各停]福空
    22

    [各停]福空
    30

    [各停]福空
    39

    [各停]福空
    46

    [各停]福空
    54

13

    [各停]福空
    01

    [各停]福空
    10

    [各停]福空
    16

    [各停]福空
    24

    [各停]福空
    31

    [各停]福空
    39

    [各停]福空
    46

    [各停]福空
    54

14

    [各停]福空
    01

    [各停]福空
    11

    [各停]福空
    20

    [各停]福空
    28

    [各停]福空
    35

    [各停]福空
    39

    [各停]福空
    46

    [各停]福空
    54

15

    [各停]福空
    01

    [各停]福空
    09

    [各停]福空
    16

    [各停]福空
    24

    [各停]福空
    30

    [各停]福空
    37

    [各停]福空
    41

    [各停]福空
    51

    [各停]福空
    58

16

    [各停]福空
    05

    [各停]福空
    12

    [各停]福空
    20

    [各停]福空
    26

    [各停]福空
    32

    [各停]福空
    39

    [各停]福空
    46

    [各停]福空
    53

17

    [各停]福空
    01

    [各停]福空
    10

    [各停]福空
    18

    [各停]福空
    24

    [各停]福空
    31

    [各停]福空
    37

    [各停]福空
    43

    [各停]福空
    52

    [各停]福空
    57

18

    [各停]福空
    01

    [各停]福空
    07

    [各停]福空
    15

    [各停]福空
    24

    [各停]福空
    31

    [各停]福空
    36

    [各停]福空
    42

    [各停]福空
    49

    [各停]福空
    58

19

    [各停]福空
    06

    [各停]福空
    13

    [各停]福空
    21

    [各停]福空
    30

    [各停]福空
    40

    [各停]福空
    45

    [各停]福空
    52

20

    [各停]福空
    00

    [各停]福空
    08

    [各停]福空
    16

    [各停]福空
    24

    [各停]福空
    29

    [各停]福空
    35

    [各停]福空
    43

    [各停]福空
    51

    [各停]福空
    58

21

    [各停]福空
    05

    [各停]福空
    12

    [各停]福空
    21

    [各停]福空
    31

    [各停]福空
    42

    [各停]福空
    51

22

    [各停]福空
    00

    [各停]福空
    10

    [各停]福空
    20

    [各停]福空
    31

    [各停]福空
    44

    [各停]福空
    57

23

    [各停]福空
    06

    [各停]福空
    14

    [各停]福空
    23

    [各停]福空
    34

    [各停]福空
    48

0

    [各停]福空
    05

    [各停]博
    16


`

var a = a.split(/[\r\n]+/).filter(p => p !== '')
var h = -1
var res = []
for (i = 0; i < a.length; i++){
  if (!a[i].startsWith(' ')){
    h = a[i]
  }
  else {
  var p = a[i].trim()
      if (!p.startsWith('[')){
        res.push(h + p)
      }
  }
}

var name = 'nakasuKaizukaHoliday'
res.forEach(p => console.log(name + '.put(' + p + ', new Ref(' + p + '));'))


//        nakasuKaizuka.put(542, new Ref(542));




